# -*- coding: utf-8 -*-
"""
Created on Thu Jan 13 16:03:14 2022

@author: KITCOOP
test0113.py
"""
'''
1.  academy2.csv 파일을 읽어서 data 데이터프레임객체에 저장하기
    KMeans 모델을 생성하여 학습시키고, 3개의 클러스터로 분류하기
    국어점수 100, 영어점수 80,수학점수 70,  과학점수 70, 학업성취도 70 인 경우
    클러스터 번호 출력하기
'''
'''
2. 1번의 내용을 DBSCAN 알고리즘을 이용하여 구현하기
'''
'''
3. batter_stats_2017.csv 데이터는 타자들의 정보를 저장한 데이터다.
 타자들의 2018년도 연봉을 예측하고, 실제(2018)연봉이 가장 많은 선수 10명만
 실제(2018)연봉, 작년(2017)연봉, 예측연봉을 그래프로 작성하기

  (1)  독립변수 : ['경기','안타','홈런','타점','볼넷','삼진','도루',
                 'BABIP', '타율', 'WAR', '연봉(2017)'] 로 설정함
     설정하여 분석하기

  (2) 독립변수 : ['경기', '볼넷', '삼진', '도루', '타율', 'WAR',
                '연봉(2017)']
      설정하여 분석하기
'''


