# -*- coding: utf-8 -*-
"""
Created on Tue Jan  4 15:01:29 2022

@author: KITCOOP
test0104.py
"""
'''
1. 임의의 값으로 10*10 배열을 만들고, 전체 최소값과 최대값, 
 행별 최대값과 최소값, 열별 최대값과 최소값을 출력하기
  임의의 값이므로 결과에 표시된 숫자는 다름
[결과]
a 최대값 : 0.9957371929996585
a 최소값 : 0.013959842183549176
a 행별 최대값 : [0.85702828 0.99573719 ... 0.99251539 0.93112787]
a 행별 최소값 : [0.04483455 0.08025441 ... 0.27046588 0.05850934]
a 열별 최대값 : [0.93112787 0.91484578 ... 0.62135503 0.95952193]
a 열별 최소값 : [0.08247677 0.04483455 ... 0.05383681 0.05850934 0.09736856] 
'''


'''
2. 임의의 값을 30개 저장하고 있는 배열을 만들고 평균값을 출력하기
  임의의 값이므로 결과에 표시된 숫자는 다름
[결과]
0.44769045640141436
'''



'''
3.  결과와 같은 값을 저장하고 있는 8*8 행렬을 생성하기
[결과]
[[0. 1. 0. 1. 0. 1. 0. 1.]
 [1. 0. 1. 0. 1. 0. 1. 0.]
 [0. 1. 0. 1. 0. 1. 0. 1.]
 [1. 0. 1. 0. 1. 0. 1. 0.]
 [0. 1. 0. 1. 0. 1. 0. 1.]
 [1. 0. 1. 0. 1. 0. 1. 0.]
 [0. 1. 0. 1. 0. 1. 0. 1.]
 [1. 0. 1. 0. 1. 0. 1. 0.]]

'''

'''
4. 0부터 10까지의 요소를 가진 배열을 생성하고
그중 3에서 8사이의 모든 요소를 음수인 값을 갖는
배열을 생성
[결과]
[ 0,  1,  2,  3, -4, -5, -6, -7,  8,  9, 10]
'''


'''
5. age.csv 파일에서 해당 지역의 인구비율과 전체지역의 인구 비율을 함께  
   그래프로 작성하기
'''
