# -*- coding: utf-8 -*-
"""
Created on Thu Jan  6 13:28:03 2022

@author: KITCOOP
test0106.py
"""
'''
1. http://www.kma.go.kr/weather/forecast/mid-term-rss3.jsp 의 내용을 
   인터넷을 통해 데이터를 수신하고 다음 결과형태로 출력하시오
[결과]
+ 구름많음
 |-  서울
 |-  인천
 |-  수원
 |-  파주
 |-  이천
 |-  평택
 |-  강릉
 |-  대전
 |-  세종
 |-  홍성
 |-  청주
 |-  충주
 |-  영동
 |-  광주
 |-  목포
 |-  여수
 |-  순천
 |-  광양
 |-  나주
 |-  전주
 |-  군산
 |-  정읍
 |-  남원
 |-  고창
 |-  무주
 |-  부산
 |-  울산
 |-  창원
 |-  진주
 |-  거창
 |-  통영
 |-  대구
 |-  안동
 |-  포항
 |-  경주
 |-  울진
 |-  울릉도
 |-  제주
 |-  서귀포
+ 흐림
 |-  춘천
 |-  원주'''   

 
'''
2. 네이버에 본인들의 주문상품 목록을 조회하기
'''

'''
3. item 별 판매 갯수 시각화하기.
   가장 많이 판매한 상품 10개만 막대그래프로 출력하기
   20220106-1.png 참조
'''   

'''
4. 멕시코풍 프랜차이즈 Chipotle의 주문 데이터를 이용하여 문제 풀기
    Chicken Bowl을 2개 이상 주문한 주문 횟수 구하기
    주문번호    Chicken Bowl 주문수량
       1                 2
       2                 3
       3                 1
         주문횟수 :   2    1,2,번주문만 횟수 
'''
